app/controllers/rooms_controller.rb

    def show
        @room_message = RoomMessage.new room: @room
        @room_messages = @room.room_messages.includes(:user)
---
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = ?  [["room_id", 1]]
SELECT "rooms".* FROM "rooms"

    def create
      @room = Room.new permitted_parameters

      if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Developer Room : by Budi Hartono"], ["created_at", "2022-12-08 09:02:07.178690"], ["updated_at", "2022-12-08 09:02:07.178690"]]

    def load_entities
      @rooms = Room.all
      @room = Room.find(params[:id]) if params[:id]
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]